app/Repository/Product/EloquentProductRepository.php

select * from `products` where `status` = 'active' order by `created_at` desc
select `tags`.*, `products_tags`.`product_id` as `pivot_product_id`, `products_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `products_tags` on `tags`.`id` = `products_tags`.`tag_id` where `products_tags`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30)
---
    public function getAll()
    {
        $products = Product::with('cat_info', 'child_cat_info', 'tags')
            ->where('status', 'active')
            ->orderBy('created_at', 'desc')
            ->get();

select `id`, `name`, `role`, `photo_path` from `users` where `users`.`id` in (1)
---
    public function getProductBySlug($slug)
    {
        $product = Product::withCount([
            'reviews as reviews_count' => function (Builder $q) {
                $q->where('status', 'active');
            }])->with([
            'reviews' => function ($q) {
                $q->where('is_parent', 1)
                ->with(['user' => function($q) {
                    $q->select('id', 'name', 'photo_path');
                },

                'replies' => function($q) {
                    $q->where('status', 'active')
                    ->with(['user' => function($q) {
                        $q->select('id', 'name', 'role', 'photo_path');
                    }]);
                }

                ])->withCount(['replies' => function($q) {
                    $q->where('status', 'active');
                }])->where('status', 'active')->get();

select products.*, SUM(order_details.qty) as total_qty from `products` inner join `order_details` on `products`.`id` = `order_details`.`product_id` inner join `orders` on `order_details`.`order_id` = `orders`.`id` where `orders`.`status` = 'delivered' group by `products`.`id` order by `total_qty` desc
---
    public function getProductMostSeller()
    {
        $products = Product::with('cat_info', 'child_cat_info')
            ->select(DB::raw('products.*, SUM(order_details.qty) as total_qty'))
            ->join('order_details', 'products.id', '=', 'order_details.product_id')
            ->join('orders', 'order_details.order_id', '=', 'orders.id')
            ->where('orders.status', 'delivered')
            ->groupBy('products.id')
            ->orderBy('total_qty', 'desc')
            ->get();

select * from `products` where `slug` = 'kaos-3' limit 1
select * from `products` where `status` = 'active' and `slug` != 'kaos-3' and `cat_id` = 3 or `child_cat_id` = 4 order by RAND()
---
    public function getProductRelated($slug)
    {
        $product = Product::where('slug', $slug)->first();
        $products = Product::where('status', 'active')
            ->where('slug', '!=', $slug)
            ->where('cat_id', $product->cat_id)
            ->orWhere('child_cat_id', $product->child_cat_id)
            ->inRandomOrder()
            ->get();

select `tags`.*, `products_tags`.`product_id` as `pivot_product_id`, `products_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `products_tags` on `tags`.`id` = `products_tags`.`tag_id` where `products_tags`.`product_id` = 2
---
    public function responseProduct($product)
    {

        return [
            'id' => $product->id,
            'slug' => $product->slug,
            'name' => $product->product_name,
            'price' => $product->price,
            'image' => $product->image,
            'images' => $product->images,
            'cat_name' => $product->cat_info->name,
            'child_cat_name' => $product->child_cat_info->name,
            'cat_id' => $product->cat_id,
            'child_cat_id' => $product->child_cat_id,
            'tags' => $product->tags->pluck('name', 'slug')->toArray(),