app/Repository/Product/EloquentProductRepository.php

select products.*, SUM(order_details.qty) as total_qty from `products` inner join `order_details` on `products`.`id` = `order_details`.`product_id` inner join `orders` on `order_details`.`order_id` = `orders`.`id` where `orders`.`status` = 'delivered' group by `products`.`id` order by `total_qty` desc
---
    public function getProductMostSeller()
    {
        $products = Product::with('cat_info', 'child_cat_info')
            ->select(DB::raw('products.*, SUM(order_details.qty) as total_qty'))
            ->join('order_details', 'products.id', '=', 'order_details.product_id')
            ->join('orders', 'order_details.order_id', '=', 'orders.id')
            ->where('orders.status', 'delivered')
            ->groupBy('products.id')
            ->orderBy('total_qty', 'desc')
            ->get();

select * from `products` where `slug` = 'kaos-2' limit 1
---
    public function responseProducts($products)
    {
        return $products->map(function($product) {
            return [
                'id' => $product->id,
                'slug' => $product->slug,
                'name' => $product->product_name,
                'price' => $product->price,
                'image' => $product->image,
                'cat_name' => $product->cat_info->name,
                'child_cat_name' => $product->child_cat_info->name,
                'featured' => $product->featured,
            ];
        });