app/Repository/Promotion/EloquentPromotionRepository.php

select * from `promotions` where `is_active` = 1 limit 1
---
    public function getActivePromotion()
    {
        $promotion = Promotion::where('is_active', true)->first();