app/Http/Controllers/HomeController.php

select * from `banners`
---
    public function index()
    {
        $products = $this->eloquentProduct->getAll()->take(6);
        $banners = DB::table('banners')->get();